#include <stdio.h>
int Storage_mode() {
	int a = 1;
	return (*(char*)&a);
}

//int main() {
//	/*
//	大端 存储模式 ：数据的高位保存在内存的低地址中，数据的低位保存在内存的高地址中
//	小端存储模式：数据的低位保存在内存的低地址中，数据的高位保存在内存的高地址中
//	*/ 
//	/*if (Storage_mode() == 1) {
//		printf("小端存储\n");
//	} 
//	if (Storage_mode() == 0) {
//		printf("大端存储\n");
//	}*/
//
//	/*
//	char a = -1;
//	signed char b = -1;
//	unsigned char c = -1;
//	printf("a=%d b=%d c=%d\n",a,b,c);
//	*/ 
//
//	/*char a = -128;
//	printf("%u\n", a);*/
//
//	int i = -20;
//	// 10000000 00000000 00000000 00010100  原
//	// 11111111 11111111 11111111 11101011  反
//	// 11111111 11111111 11111111 11101100  补
//	int j = 10;
//	// 00000000 00000000 00000000 00001010
//	
//	printf("%d\n",i+j);
//	// 11111111 11111111 11111111 11101100  补
//	// +
//	// 00000000 00000000 00000000 00001010  补
//	// =
//	// 11111111 11111111 11111111 11110110  补
//	// 11111111 11111111 11111111 11110101  反
//	// 10000000 00000000 00000000 00001010  原
//
//	return 0;
//}