//#include <stdio.h>
//struct Test
//{
//    int Num;
//    char* pcName;
//    short sDate;
//    char cha[2];
//    short sBa[4];
//}*p;
//
//int main() {
//
//    /*int a[5][5];
//    int(*p)[4];
//    p = a;
//    printf("%p,%d\n", &p[4][2] - &a[4][2], &p[4][2] - &a[4][2]);*/
//
//    //&p[4][2] - &a[4][2]  
//    //&a[4][2]
//    //&p[4][2] = &*(*(p+4)+2)
//    // a[5][5] =  00000 | 00000 | 00000 | 00000 | 00000
//    //                                       |      | 
//    //                                &p[4][2]  &a[4][2]  
//    // 
//    // p = a; p的类型为int(*)[4] ，a的类型为 int(*)[5]
//    // 所以 p 指向的是 a前面的4个元素
//    // 
//    // 
//    // &p[4][2] - &a[4][2] 小地址处减大地址处,所以这个数是负数，它们间隔有4个元素，所以这个数是 -4
//    // 
//    // -4 = 
//    // 1000 0000   0000 0000   0000 0000   0000 0100 源
//    // 1111 1111   1111 1111   1111 1111   1111 1011 反
//    // 1111 1111   1111 1111   1111 1111   1111 1100 补
//    //   F   F      F    F       F   F       F    C  转换为16进制后
//    // 
//    // 
//    // &p[4][2] - &a[4][2]
//    // 所以它以地址形式打印就是直接打印-4的补码，输出的地址都是16进制，所以-4的补码转换为16进制就是 FFFFFFFC
//    // 以整型输出就是 -4
//    // 
//    // 
//    // 
//
// 
//
//    //int a[3][2] = { (0, 1), (2, 3), (4, 5) };
//    //int* p;
//    //p = a[0];
//    //printf("%d", p[0]); //1
//
//
//
//   
//	  //int a[4] = { 1, 2, 3, 4 };
//    //int* ptr1 = (int*)(&a + 1);
//    //int* ptr2 = (int*)((int)a + 1);
//    //printf("%x,%x", ptr1[-1], *ptr2);//0x4，0x2000000
//    //return 0;
//    
//
//    //假设p 的值为0x100000。 如下表表达式的值分别为多少？
//    //已知，结构体Test类型的变量大小是20个字节
//    //p = (struct Test*)0x100000;
//    //printf("%p\n", p + 0x1);// 结构体为20个字节，结构体指针加1，加的就是20个字节，
//    //printf("%p\n", (unsigned long)p + 0x1); //强制类型转换为整型 0x100001 整数加1
//    //printf("%p\n", (unsigned int*)p + 0x1); //整型指针加1，加的是4个字节  0x100004   整型指针加1
//   
//
//
//
//
//    //int a[5] = { 1, 2, 3, 4, 5 };
//    //int* ptr = (int*)(&a + 1);
//    //printf("%d,%d", *(a + 1), *(ptr - 1)); //2,5
//	return 0;
//}