#include <stdio.h>
#include <stdlib.h>
// 隐式类型转换

// 整型提升是按照变量的数据类型的符号位来提升的，无符号数提升补0
/* int main()
{
    char a = 3;
    // 00000000 00000000 00000000 00000011
    // 00000011
    char b = 127;
    // 00000000 00000000 00000000 01111111
    // 01111111
    char c = a + b;
    // 00000000 00000000 00000000 00000011 a
    // 00000000 00000000 00000000 01111111 b
    // 00000000 00000000 00000000 10000010 a+b
    // c = 10000010 补码  整型提升是按照变量的数据类型的符号位来提升的，无符号数提升补0
    // 11111111 11111111 11111111 10000010 补码
    // 11111111 11111111 11111111 10000001 反码
    // 10000000 00000000 00000000 01111110 源码
    // -126
    printf("%d\n", c); // -126

    system("pause");
    return 0;
} */

int main()
{
    // char a = 0xb6;// 1011 0110
    // short b = 0xb600;
    // int c = 0xb6000000;
    // //11111111 11111111 11111111 10110110 ==  1011 0110 ?
    // if (a == 0xb6)//a不是整型所以要进行整型提升,所以他们不相等
    // {
    //     printf("a\n");
    // }
    // if (b == 0xb600)//b不是整型所以要进行整型提升,所以他们不相等
    // {
    //     printf("b\n");
    // }
    // if (c == 0xb6000000) // c为整型所以不需要整型提升
    // {
    //     printf("c\n");
    // }

    // 只要参与表达式运算的值没有达到整型，就会发生整型提升
    // 表达式中各种长度可能小于int长度的整型值，都必须先转换为int或unsigned int，然后才能送入CPU执行运算
    // char c = 1;
    // printf("%u\n", sizeof(c));
    // printf("%u\n", sizeof(+c)); // 只要参与表达式运算的值没有达到整型，就会发生整型提升，提升为整型之后他就是4个字节
    // printf("%u\n", sizeof(!c));

    // long double
    // double
    // float
    // unsigned long int
    // long int
    // unsigned int
    // int

    int i = 1;
    int a = (++i) + (++i) + (++i);
    printf("%d\n", a);
    system("pause");
    return 0;
}